presentations/kafka.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Kafka</title>
<meta name="author" content="(Christopher Thompson)"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/simple.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Kafka</h1>
</section>


<section>
<section id="slide-org521ff0e" data-background="https://content.linkedin.com/content/dam/engineering/en-us/blog/migrated/producer_consumer.png" data-background-size="60%">
<h2 id="org521ff0e">.</h2>

</section>
</section>
<section>
<section id="slide-org82c3234">
<h2 id="org82c3234">replicated log</h2>
<div class="outline-text-2" id="text-org82c3234">
</div>
</section>
<section id="slide-org423ed11" data-background="https://kafka.apache.org/21/images/log_consumer.png" data-background-size="60%">
<h3 id="org423ed11"></h3>



</section>
</section>
<section>
<section id="slide-org375c5a5" data-background="https://s3.amazonaws.com/growlermag-media/ElectricFetusTurntables-7.jpg" data-background-size="60%">
<h2 id="org375c5a5"></h2>
</section>
<section id="slide-org573ef9b" data-background="https://content.linkedin.com/content/dam/engineering/en-us/blog/migrated/partitioned_log_0.png" data-background-size="60%">
<h3 id="org573ef9b">.</h3>



</section>
</section>
<section>
<section id="slide-orgd546b1b">
<h2 id="orgd546b1b">Kafka</h2>
<ul>
<li class="fragment appear">replicated log</li>
<li class="fragment appear">↳ persistence</li>
<li class="fragment appear">↳ consumer tracking</li>
<li class="fragment appear">↳ confidence</li>
<li class="fragment appear">↳ design</li>

</ul>

</section>
<section id="slide-org30d89b4" data-background="https://www.scaleway.com/assets/images/docs/schema-kafka.png" data-background-size="60%">
<h4 id="org30d89b4"></h4>

</section>
<section id="slide-org1ff83aa" data-background="https://res.infoq.com/presentations/cloud-native-kafka-netflix/en/slides/sl32-1523574474681.jpg" data-background-size="60%">
<h4 id="org1ff83aa"></h4>




</section>
</section>
<section>
<section id="slide-org5239495">
<h2 id="org5239495">producer</h2>
<div class="org-src-container">

<pre  class="src src-clojure"><span style="color: #4f97d7;">(</span>produce conn <span style="color: #bc6ec5;">{</span><span style="color: #a45bad;">:key</span> <span style="color: #a45bad;">123</span> <span style="color: #a45bad;">:value</span> <span style="color: #2d9574;">"hello"</span> <span style="color: #a45bad;">:topic</span> <span style="color: #2d9574;">"greetings"</span><span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org75aeca2">
<h2 id="org75aeca2">consumer</h2>
<div class="org-src-container">

<pre  class="src src-clojure"><span style="color: #4f97d7;">(</span>consume conn <span style="color: #2d9574;">"greetings"</span> println<span style="color: #4f97d7;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org1f69262" data-background="https://www.americasquarterly.org/sites/default/files/images/IMG_3953_cropped.jpg" data-background-size="60%">
<h2 id="org1f69262"></h2>
</section>
<section id="slide-org5611443" data-background="https://kafka.apache.org/21/images/log_compaction.png" data-background-size="60%">
<h3 id="org5611443"></h3>



</section>
</section>
<section>
<section id="slide-org0560154">
<h2 id="org0560154">resources</h2>
<p>
<a href="https://hackernoon.com/a-super-quick-comparison-between-kafka-and-message-queues-e69742d855a8">brief blog post with unique focus</a>
</p>

<p>
<a href="https://engineering.linkedin.com/kafka/benchmarking-apache-kafka-2-million-writes-second-three-cheap-machines">performance analysis from 2014</a>
</p>

<p>
<a href="https://kafka.apache.org/documentation/#design">an afternoon of dizzyness</a>
</p>

<p>
<a href="https://jack-vanlightly.com/blog/2017/12/3/rabbitmq-vs-kafka-series-introduction">RabbitMQ vs Kafka comparison</a>
</p>

<p>
<a href="http://javierholguera.com/2018/06/13/kafka-defaults-that-you-should-re-consider-i/">thoughts on default conf values</a>
</p>

</section>
<section id="slide-org44783cd">
<h3 id="org44783cd">best configuration for a message queue</h3>
<ul>
<li>topic: change min.insync.replicas to replication - 1</li>
<li>topic: replication 3, min.insync 2 (typical)</li>
<li>producer: acks all</li>

</ul>
</section>
</section>
</div>
</div>
<script src="http://cdn.jsdelivr.net/reveal.js/3.0.0/lib/js/head.min.js"></script>
<script src="http://cdn.jsdelivr.net/reveal.js/3.0.0/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,
margin: 0.00,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'none', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
